spec/support/webhooks/stripe/refunded.json

{
  "id": "evt_3LwqQFJuOnwQq9Qx1NIof0sn",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1666716977,
  "data": {
    "object": {
      "id": "ch_3LwqQFJuOnwQq9Qx173xACg7",
      "object": "charge",
      "amount": 100,
      "amount_captured": 100,
      "amount_refunded": 100,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": "txn_3LwqQFJuOnwQq9Qx1b29WISa",
      "billing_details": {
        "address": {
          "city": null,
          "country": null,
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": null,
        "name": null,
        "phone": null
      },
      "calculated_statement_descriptor": "RIBON",
      "captured": true,
      "created": 1666716975,
      "currency": "usd",
      "customer": null,
      "description": "(created by Stripe CLI)",
      "destination": null,
      "dispute": null,
      "disputed": false,
      "failure_balance_transaction": null,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {
      },
      "invoice": null,
      "livemode": false,
      "metadata": {
      },
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "risk_score": 0,
        "seller_message": "Payment complete.",
        "type": "authorized"
      },
      "paid": true,
      "payment_intent": "pi_123456",
      "payment_method": "card_1LwqQFJuOnwQq9QxC8RJdXuk",
      "payment_method_details": {
        "card": {
          "brand": "visa",
          "checks": {
            "address_line1_check": null,
            "address_postal_code_check": null,
            "cvc_check": null
          },
          "country": "US",
          "exp_month": 10,
          "exp_year": 2023,
          "fingerprint": "uus1v7MCal1FnygG",
          "funding": "credit",
          "installments": null,
          "last4": "4242",
          "mandate": null,
          "network": "visa",
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "receipt_email": null,
      "receipt_number": null,
      "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xSlJnYVJKdU9ud1FxOVF4KLGq4JoGMgYbZe2PjmU6LBaaCE3PA59R13XQ-psLjJoNfbQYxrtNOM4R88AxuEXW3SpKB1S4aDs6ZRwV",
      "refunded": true,
      "refunds": {
        "object": "list",
        "data": [
          {
            "id": "re_3LwqQFJuOnwQq9Qx1eicKTBU",
            "object": "refund",
            "amount": 100,
            "balance_transaction": "txn_3LwqQFJuOnwQq9Qx1nYyOjcJ",
            "charge": "ch_3LwqQFJuOnwQq9Qx173xACg7",
            "created": 1666716976,
            "currency": "usd",
            "metadata": {
            },
            "payment_intent": null,
            "reason": null,
            "receipt_number": null,
            "source_transfer_reversal": null,
            "status": "succeeded",
            "transfer_reversal": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges/ch_3LwqQFJuOnwQq9Qx173xACg7/refunds"
      },
      "review": null,
      "shipping": null,
      "source": {
        "id": "card_1LwqQFJuOnwQq9QxC8RJdXuk",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": null,
        "cvc_check": null,
        "dynamic_last4": null,
        "exp_month": 10,
        "exp_year": 2023,
        "fingerprint": "uus1v7MCal1FnygG",
        "funding": "credit",
        "last4": "4242",
        "metadata": {
        },
        "name": null,
        "tokenization_method": null
      },
      "source_transfer": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    },
    "previous_attributes": {
      "amount_refunded": 0,
      "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xSlJnYVJKdU9ud1FxOVF4KLCq4JoGMga8TY6BlrU6LBaKtQsploJcxVU1pkgrENAkjqIf1Ujg5y0LkF14RA0p0LSHKUKNQBzfXZzZ",
      "refunded": false,
      "refunds": {
        "data": [
        ],
        "total_count": 0
      }
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_sQh0Tri23IkQcY",
    "idempotency_key": "c029a834-b671-467a-b226-2cb031d14be7"
  },
  "type": "charge.refunded"
}